#+TITLE: Local User Customizations
#+OPTIONS: toc:nil num:nil ^:nil

*** Key bindings
    CLOCK: [2011-08-14 Sun 00:57]--[2011-08-14 Sun 01:00] =>  0:03
#+begin_src emacs-lisp
  ;;Standard key bindings
  (setq org-speed-commands-user (quote (("P" . org-set-property))))
  (global-set-key "\C-cl" 'org-store-link)
  (global-set-key "\C-ca" 'org-agenda)
  (global-set-key "\C-cb" 'org-iswitchb)
  ;;flyspell mode for spell checking everywhere
                                          ;(add-hook 'org-mode-hook 'turn-on-flyspell 'append)
  ;;Custom Key Bindings
  (global-set-key (kbd "<f12>") 'org-agenda)
  (global-set-key (kbd "<f7>") 'bh/set-truncate-lines)
  (global-set-key (kbd "<f8>") 'org-cycle-agenda-files)
  (global-set-key (kbd "<f9> c") 'calendar)
  (global-set-key (kbd "<f9> o") 'bh/hide-other)
  (global-set-key (kbd "<f9> s") '(lambda () (interactive) (switch-to-buffer "*scratch*")))
  (global-set-key (kbd "<f9> i") '(lambda () (interactive) (find-file-read-only "~/.emacs.d/yhe1.org")))
  (global-set-key (kbd "<f9> r") '(lambda () (interactive) (find-file-read-only "~/Dropbox/org/notes/reference.org")))
  (global-set-key (kbd "<f9> n") 'org-narrow-to-subtree)
  (global-set-key (kbd "<f9> w") 'widen)
  (global-set-key (kbd "C-<f9>") 'winner-undo)
  (global-set-key (kbd "C-<f10>") 'winner-redo)
  (global-set-key (kbd "<f11>") 'org-clock-goto)
  (global-set-key (kbd "C-<f11>") 'org-clock-in)
  ;;  (global-set-key (kbd "C-s-<f12>") 'bh/save-then-publish)
  (global-set-key (kbd "C-M-c") 'org-capture)
  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-`") 'ido-restrict-to-matches)
  
  (defun bh/hide-other ()
    (interactive)
    (save-excursion
      (org-back-to-heading)
      (org-shifttab)
      (org-reveal)
      (org-cycle)))
  
  (defun bh/set-truncate-lines ()
    "Toggle value of truncate-lines and refresh window display."
    (interactive)
    (setq truncate-lines (not truncate-lines))
    ;; now refresh window display (an idiom from simple.el):
    (save-excursion
      (set-window-start (selected-window)
                        (window-start (selected-window)))))
      
   (defun bh/untabify ()
    (interactive)
    (untabify (point-min) (point-max)))
  
  (add-hook 'org-mode-hook
                '(lambda ()
                   (local-set-key (kbd "C-c C-v K") 'org-babel-remove-result-in-buffer)
                   (local-set-key (kbd "C-c C-v k") 'org-babel-remove-result)))
    
  (defun org-babel-remove-result-in-buffer ()
    (interactive)
           (org-babel-map-src-blocks nil (org-babel-remove-result)))
#+end_src

*** Org-capture
#src-name: org-capture
#+begin_src emacs-lisp
  (setq org-default-notes-file (concat org-directory "/capture.org"))
    (setq org-capture-templates
          '(  ("t" "Todo" entry (file+headline "~/git/org/agenda/capture.org" "Tasks") "* TODO %?\n %i\n %a")
              ("b" "Blog" entry (file+headline "~/git/org/agenda/capture.org" "Blog") "* TODO %?\n %i\n %a")
              ("n" "Note" entry (file+headline "~/git/org/notes/notescapture.org" "Notescapture") "* %? \n%U\n" )
              ("r" "Reference" entry (file+headline "~/git/org/notes/reference.org" "Reference Refile") "* %? \n  " )
              ("j" "Journal" entry (file+headline "~/git/org/agenda/capture.org" "Journal") "* %?\n"  :clock-in t :clock-resume t) 
              ("h" "Habit" entry (file "~/git/org/refile.org")
               "* NEXT %?\n%U\n%a\nSCHEDULED: %t .+1d/3d\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n  %i")
              ;;("a" "Archive" entry (file+headline "~/git/org/agenda/capture.org" "Archive") "* %? \n%U\n " )
              ;;("e" "Emacs" entry (file+headline "~/git/org/agenda/capture.org" "Emacs") "* TODO %?\n %i\n %a") 
              ;;("g" "Git" entry (file+headline "~/git/org/agenda/capture.org" "Git") "* TODO %?\n %i\n %a")
              ;;("u" "Ubuntu" entry (file+headline "~/git/org/agenda/capture.org" "Ubuntu") "* TODO %?\n %i\n") 
              ))
  
  ;; Remove empty LOGBOOK drawers on clock out
  (defun bh/remove-empty-drawer-on-clock-out ()
    (interactive)
    (save-excursion
      (beginning-of-line 0)
      (org-remove-empty-drawer-at "LOGBOOK" (point))))
  
  (add-hook 'org-clock-out-hook 'bh/remove-empty-drawer-on-clock-out 'append)
  
#+end_src

#+results:
| bh/remove-empty-drawer-on-clock-out |

